[
  "The strongest muscle in the human body is the masseter, responsible for jaw movement.",
  "You're taller in the morning than at night due to the compression of spinal discs during the day.",
  "Your taste buds have a lifespan of about 10 to 14 days.",
  "Fingernails grow faster than toenails, and they grow faster on your dominant hand.",
  "Babies are born with 300 bones, but as they grow, some fuse together, leaving adults with 206 bones.",
  "Sneezes can travel up to 100 miles per hour and expel germs at around 2,000 mph.",
  "Your heart beats around 100,000 times a day, pumping about 2,000 gallons of blood.",
  "Your stomach lining renews itself every few days to prevent being digested by stomach acid.",
  "The cornea is the only part of the body with no blood supply; it gets oxygen directly from the air.",
  "Humans shed about 600,000 particles of skin every hour, accounting for a large part of household dust.",
  "The small intestine is around 22 feet long, responsible for nutrient absorption.",
  "Your brain generates about 20 watts of electrical power, enough to power a dim light bulb.",
  "Humans are the only primates with mostly hidden noses.",
  "The human nose can detect around 1 trillion different odors.",
  "Your body produces enough saliva in a lifetime to fill two swimming pools.",
  "Your eyes are always the same size from birth, but your nose and ears never stop growing.",
  "The brain processes pain signals slower than touch signals, which is why you feel pain after injuring yourself.",
  "The liver is the only organ that can regenerate itself completely.",
  "Humans have a unique fingerprint, but their tongue print is also unique.",
  "The human body can produce enough heat in 30 minutes to boil half a gallon of water.",
  "The cochlea in the inner ear is responsible for converting sound vibrations into electrical signals for the brain.",
  "Your skin is the largest organ, with an average weight of 6 pounds.",
  "The small muscles in your eyes move around 100,000 times a day.",
  "The human body has enough iron to make a small nail.",
  "It's impossible to tickle yourself because your brain predicts the sensation when you try."
]