[
  "The mimic octopus can imitate the appearance and behaviors of other marine animals to evade predators.",
  "Elephants have the ability to recognize themselves in a mirror, a trait shared by only a few animals, including dolphins and great apes.",
  "Cows have best friends and can become stressed when separated from them.",
  "The tongue of a blue whale can weigh as much as an elephant, and its heart is the size of a small car.",
  "A group of flamingos is called a 'flamboyance.'",
  "Neutron stars are so dense that a teaspoonful of neutron star material would weigh about 6 billion tons.",
  "There are more stars in the universe than there are grains of sand on all the beaches of Earth.",
  "Venus rotates on its axis so slowly that its day is longer than its year.",
  "The Voyager 1 spacecraft, launched in 1977, has traveled so far that its radio signals take over 21 hours to reach Earth.",
  "The cosmic microwave background radiation is the afterglow of the Big Bang and is detectable as faint radio static on unused TV channels.",
  "Honey never spoils; archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible.",
  "The world's largest living structure is the Great Barrier Reef, stretching over 2,300 kilometers (1,430 miles) off the coast of Australia.",
  "Lightning can generate temperatures hotter than the surface of the sun, reaching up to 30,000 degrees Celsius (54,000 degrees Fahrenheit).",
  "A single teaspoon of soil can contain more microorganisms than there are humans on Earth.",
  "Trees communicate with each other through an underground network of fungi known as the 'Wood Wide Web.'",
  "The human brain can generate more electrical impulses in a single day than all the telephones in the world combined.",
  "Your taste buds have a lifespan of about 10 to 14 days.",
  "The strongest muscle in the human body, relative to its size, is the masseter muscle, which allows your jaw to chew with incredible force.",
  "During sleep paralysis, your brain wakes up before your body, leading to temporary paralysis and often vivid hallucinations.",
  "The human nose can remember 50,000 different scents.",
  "The Great Wall of China is not visible from space with the naked eye, contrary to popular belief.",
  "The library of Alexandria, one of the most famous libraries in history, was said to have housed over half a million scrolls before it was destroyed.",
  "Cleopatra lived closer in time to the moon landing than to the construction of the Great Pyramid of Giza.",
  "The shortest war in history lasted just 38 to 45 minutes, the Anglo-Zanzibar War of 1896.",
  "The Eiffel Tower can grow up to 6 inches (15 cm) in the summer due to the expansion of the iron in the heat."
]